#include <iostream>
using namespace std;
int main() {

	/*1. —оставьте программу, вывод€щую на экран квадраты чисел от 10 до 20.
	for (int i = 10; i <= 20; i = i + 1) {
		cout << i * i << endl;
	}*/

	/*2. —оставьте программу, которая вычисл€ет сумму чисел от 1 до n.значение n вводитс€ с клавиатуры.
	int s = 0;
	int n;
	cin >> n;
	for (int i = 1; i < n; i++)
		cout << i << endl;*/

	/*3.  составьте программу, котора€ вычисл€ет произведение чисел от 1 до n.n вводитс€ с клавиатуры.
	int s = 0;
	int n;
	cin >> n;
	for (int i = 1; i < n; i = i+1){
		cout << i*i << endl;
	}*/
		




}